app/views/users/show.html.erb

SELECT "comments".* FROM "comments"  WHERE "comments"."user_id" = $1  [["user_id", 2]]
SELECT COUNT(*) FROM "comments"  WHERE "comments"."user_id" = $1  [["user_id", 2]]
SELECT COUNT(*) FROM "comments"  WHERE "comments"."user_id" = $1 AND "comments"."rating" = '5_stars'  [["user_id", 2]]
---
    <h3>Member Since: <%= @user.created_at.strftime("%B %Y") %></h3>
    <h4> <%= @user.comments.count %> total comments</h4>
    <h4><%= @user.comments.where(rating: '5_stars').count %> total 5 star reviews</h4>

SELECT "places".* FROM "places"  WHERE "places"."user_id" = $1  [["user_id", 2]]
---
<br /><br />
<% @user.places.each do |place| %>

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---

    <% if place.user.present? %>

SELECT "comments".* FROM "comments"  WHERE "comments"."place_id" = $1  [["place_id", 14]]
---

    <% if place.comments.present? %>