app/controllers/comments_controller.rb

  def create
    @place = Place.find(params[:place_id])
    @place.comments.create(comment_params.merge(user: current_user))
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = $1 LIMIT 1  [["id", 10]]
INSERT INTO "comments" ("created_at", "message", "place_id", "rating", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2016-11-26 07:06:19.456736"], ["message", "You are still in the heart"], ["place_id", 10], ["rating", "1"], ["updated_at", "2016-11-26 07:06:19.456736"], ["user_id", 2]]