app/controllers/photos_controller.rb

SELECT  "places".* FROM "places"  WHERE "places"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "photos" ("caption", "created_at", "picture", "place_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["caption", "This is a duck"], ["created_at", "2016-12-22 08:42:19.490045"], ["picture", "duck.jpg"], ["place_id", 1], ["updated_at", "2016-12-22 08:42:19.490045"]]
---
  def create
    @place = Place.find(params[:place_id])
    @place.photos.create(photo_params)