app/controllers/places_controller.rb

SELECT "places".* FROM "places"
SELECT COUNT(*) FROM "places"
---
  def index
    @places = Place.page(params[:page]).per(5)

INSERT INTO "places" ("address", "created_at", "description", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["address", "N/A"], ["created_at", "2016-11-18 07:30:46.816448"], ["description", "Same greasy crap"], ["name", "KFC"], ["updated_at", "2016-11-18 07:30:46.816448"], ["user_id", 2]]
---
  def create
    @place = current_user.places.create(place_params)

SELECT  "places".* FROM "places"  WHERE "places"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @place = Place.find(params[:id])

SELECT  "places".* FROM "places"  WHERE "places"."id" = $1 LIMIT 1  [["id", 2]]
---
  def edit
    @place = Place.find(params[:id])

SELECT  "places".* FROM "places"  WHERE "places"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "places" SET "address" = $1, "latitude" = $2, "longitude" = $3, "name" = $4, "updated_at" = $5 WHERE "places"."id" = 1  [["address", "62-02 Fresh Pond Road New York, NY 11379"], ["latitude", 40.7101799828921], ["longitude", -73.8993471991865], ["name", "KFC Chicken"], ["updated_at", "2017-04-24 03:53:50.279949"]]
---
  def update
    @place = Place.find(params[:id])

    if @place.user != current_user
        return render text: 'Not Allowed', status: :forbidden
    end

    @place.update_attributes(place_params)

SELECT  "places".* FROM "places"  WHERE "places"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "places" WHERE "places"."id" = $1  [["id", 3]]
---
  def destroy
    @place = Place.find(params[:id])
    if @place.user != current_user
      return render text: 'Not Allowed', status: :forbidden
    end
    @place.destroy