app/views/places/index.html.erb


  <% if place.user.present? %>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]


 <% if place.comments.present? %>
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."place_id" = $1  ORDER BY "comments"."id" DESC LIMIT 1  [["place_id", 1]]

      <div class="col-12">
      <% if place.photos.present? %>
---
SELECT "photos".* FROM "photos"  WHERE "photos"."place_id" = $1  [["place_id", 2]]