app/views/places/show.html.erb

  <p><% @place.description %></p>
  <p><% @place.photos.create %></p>
---
INSERT INTO "photos" ("created_at", "place_id", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2016-12-23 07:01:32.487228"], ["place_id", 1], ["updated_at", "2016-12-23 07:01:32.487228"]]

 <div class="clear"></div>
    <% @place.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos"  WHERE "photos"."place_id" = $1  [["place_id", 1]]

<div class="clear"></div>
<% @place.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments"  WHERE "comments"."place_id" = $1  [["place_id", 10]]